In [2]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [3]:
df = pd.DataFrame([['rohit',23,'executive',25000],
                  ['raj',28,'Jr executive',21000],
                  ['rahul',27,'executive',20000],
                  ['roshan',26,'Sr executive',29000],
                  ['rohan',21,'executive',20500],
                  ['rony',25,'Sr executive',28000],
                  ['robert',23,'executive',21000],
                  ['rabi',29,'sr executive',27000]],
                  columns = ['name','age','designation','salary'])

In [4]:
df.head()

     name  age   designation  salary
0   rohit   23     executive   25000
1     raj   28  Jr executive   21000
2   rahul   27     executive   20000
3  roshan   26  Sr executive   29000
4   rohan   21     executive   20500

In [5]:
x = df[['name','age','designation']]
y = df[['salary']]

In [6]:
x.head()

     name  age   designation
0   rohit   23     executive
1     raj   28  Jr executive
2   rahul   27     executive
3  roshan   26  Sr executive
4   rohan   21     executive

In [7]:
y.head()

   salary
0   25000
1   21000
2   20000
3   29000
4   20500

In [8]:
x.drop(['name'],axis=1,inplace= True)

C:\Users\sengu\AppData\Local\Temp\ipykernel_21488\3165070810.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  x.drop(['name'],axis=1,inplace= True)

In [9]:
x.head()

   age   designation
0   23     executive
1   28  Jr executive
2   27     executive
3   26  Sr executive
4   21     executive

In [10]:
from sklearn.preprocessing import OneHotEncoder

In [11]:
enc = OneHotEncoder()

In [12]:
enc_data = pd.DataFrame(enc.fit_transform(x[['designation']]).toarray())

In [13]:
enc_data

     0    1    2    3
0  0.0  0.0  1.0  0.0
1  1.0  0.0  0.0  0.0
2  0.0  0.0  1.0  0.0
3  0.0  1.0  0.0  0.0
4  0.0  0.0  1.0  0.0
5  0.0  1.0  0.0  0.0
6  0.0  0.0  1.0  0.0
7  0.0  0.0  0.0  1.0

In [14]:
x = x.join(enc_data)

In [15]:
x.head()

   age   designation    0    1    2    3
0   23     executive  0.0  0.0  1.0  0.0
1   28  Jr executive  1.0  0.0  0.0  0.0
2   27     executive  0.0  0.0  1.0  0.0
3   26  Sr executive  0.0  1.0  0.0  0.0
4   21     executive  0.0  0.0  1.0  0.0

In [16]:
x.drop(['designation'],axis=1,inplace= True)

In [17]:
x.head()

   age    0    1    2    3
0   23  0.0  0.0  1.0  0.0
1   28  1.0  0.0  0.0  0.0
2   27  0.0  0.0  1.0  0.0
3   26  0.0  1.0  0.0  0.0
4   21  0.0  0.0  1.0  0.0

In [18]:
from sklearn.model_selection import train_test_split

In [34]:
xtrain , xtest , ytrain , ytest = train_test_split(x,y,test_size = 0.3)

In [35]:
xtrain

   age    0    1    2    3
5   25  0.0  1.0  0.0  0.0
2   27  0.0  0.0  1.0  0.0
7   29  0.0  0.0  0.0  1.0
1   28  1.0  0.0  0.0  0.0
3   26  0.0  1.0  0.0  0.0

In [36]:
xtest

   age    0    1    2    3
4   21  0.0  0.0  1.0  0.0
6   23  0.0  0.0  1.0  0.0
0   23  0.0  0.0  1.0  0.0

In [37]:
ytrain

   salary
5   28000
2   20000
7   27000
1   21000
3   29000

In [38]:
ytest

   salary
4   20500
6   21000
0   25000

In [39]:
from sklearn.linear_model import LinearRegression

In [40]:
lr = LinearRegression()

In [41]:
model = lr.fit(xtrain,ytrain)

C:\Users\sengu\anaconda3\lib\site-packages\sklearn\utils\validation.py:1858: FutureWarning: Feature names only support names that are all strings. Got feature names with dtypes: ['int', 'str']. An error will be raised in 1.2.
  warnings.warn(

In [42]:
ypred = model.predict(xtest)

C:\Users\sengu\anaconda3\lib\site-packages\sklearn\utils\validation.py:1858: FutureWarning: Feature names only support names that are all strings. Got feature names with dtypes: ['int', 'str']. An error will be raised in 1.2.
  warnings.warn(

In [43]:
ypred

array([[14000.],
       [16000.],
       [16000.]])

In [44]:
model.score(xtrain,ytrain)

C:\Users\sengu\anaconda3\lib\site-packages\sklearn\utils\validation.py:1858: FutureWarning: Feature names only support names that are all strings. Got feature names with dtypes: ['int', 'str']. An error will be raised in 1.2.
  warnings.warn(

1.0

In [45]:
model.score(xtest,ytest)

C:\Users\sengu\anaconda3\lib\site-packages\sklearn\utils\validation.py:1858: FutureWarning: Feature names only support names that are all strings. Got feature names with dtypes: ['int', 'str']. An error will be raised in 1.2.
  warnings.warn(

-11.18493150684937

#### Ridge & Lasso Regression

L1 Regulrazation , L2 Regularazation

In [46]:
boston = pd.read_csv('boston.csv')

In [47]:
boston.head()

,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,b,lstat,medv
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222,18.7,396.90,5.33,36.2

In [60]:
x = boston[['crim','zn','indus','chas','nox','rm','age']]

In [61]:
y = boston[['medv']]

In [62]:
x.head()

      crim    zn  indus  chas    nox     rm   age
0  0.00632  18.0   2.31     0  0.538  6.575  65.2
1  0.02731   0.0   7.07     0  0.469  6.421  78.9
2  0.02729   0.0   7.07     0  0.469  7.185  61.1
3  0.03237   0.0   2.18     0  0.458  6.998  45.8
4  0.06905   0.0   2.18     0  0.458  7.147  54.2

In [63]:
y.head()

   medv
0  24.0
1  21.6
2  34.7
3  33.4
4  36.2

In [64]:
xtrain,xtest, ytrain,ytest = train_test_split(x,y,test_size=0.2)

In [65]:
lr = LinearRegression().fit(xtrain,ytrain)

In [66]:
lr.score(xtrain,ytrain)

0.6025949842239396

In [67]:
lr.score(xtest,ytest)

0.5065415796585204

In [68]:
from sklearn.linear_model import Ridge

In [83]:
ridge = Ridge(alpha=25).fit(xtrain,ytrain)

In [84]:
ridge.score(xtest,ytest)

0.5115517921953098